{
  "0": 0,
  "1": 1,
  "2": 2,
  "3": 3,
  "4": 5,
  "5": 13,
  "6": 12,
  "7": 6,
  "8": 14,
  "9": 7,
  "10": 17,
  "11": 5,
  "12": 7,
  "13": 4,
  "14": 6,
  "15": 18,
  "16": 20,
  "17": 7,
  "18": 8,
  "19": 8,
  "20": 6,
  "21": 18,
  "22": 6,
  "23": 24,
  "24": 7,
  "25": 6,
  "26": 5,
  "27": 19,
  "28": 8,
  "29": 19,
  "30": 15,
  "31": 14,
  "32": 8,
  "33": 10,
  "34": 15,
  "35": 10,
  "36": 23,
  "37": 22,
  "38": 11,
  "39": 10,
  "40": 16,
  "41": 14,
  "42": 8,
  "43": 7,
  "44": 20,
  "45": 6,
  "46": 7,
  "47": 4,
  "48": 11,
  "49": 11,
  "50": 11,
  "51": 14,
  "52": 11,
  "53": 8,
  "54": 16,
  "55": 28,
  "56": 8,
  "57": 11,
  "58": 8,
  "59": 6,
  "60": 6,
  "61": 25,
  "62": 8,
  "63": 4,
  "64": 11,
  "65": 11,
  "66": 4,
  "67": 14,
  "68": 26,
  "69": 10,
  "70": 8,
  "71": 19,
  "72": 22,
  "73": 10,
  "74": 11,
  "75": 10,
  "76": 8,
  "77": 19,
  "78": 8,
  "79": 4,
  "80": 4,
  "81": 16,
  "82": 30,
  "83": 21,
  "84": 26,
  "85": 24,
  "86": 4,
  "87": 9,
  "88": 6,
  "89": 26,
  "90": 4,
  "91": 11,
  "92": 7,
  "93": 6,
  "94": 9,
  "95": 10,
  "96": 4,
  "97": 22,
  "98": 7,
  "99": 23,
  "100": 20,
  "101": 10,
  "102": 4,
  "103": 16,
  "104": 14,
  "105": 26,
  "106": 22,
  "107": 16,
  "108": 19,
  "109": 11,
  "110": 10,
  "111": 14,
  "112": 28,
  "113": 4,
  "114": 11,
  "115": 8,
  "116": 9,
  "117": 4,
  "118": 11,
  "119": 9,
  "120": 32,
  "121": 18,
  "122": 23,
  "123": 9,
  "124": 11,
  "125": 8,
  "126": 11,
  "127": 8,
  "128": 15,
  "129": 14,
  "130": 14,
  "131": 11,
  "132": 11,
  "133": 22,
  "134": 16,
  "135": 4,
  "136": 25,
  "137": 7,
  "138": 4,
  "139": 21,
  "140": 7,
  "141": 11,
  "142": 9,
  "143": 15,
  "144": 14,
  "145": 9,
  "146": 4,
  "147": 4,
  "148": 8,
  "149": 4,
  "150": 4,
  "151": 9,
  "152": 11,
  "153": 22,
  "154": 10,
  "155": 9,
  "156": 4,
  "157": 16,
  "158": 11,
  "159": 10,
  "160": 4,
  "161": 10,
  "162": 8,
  "163": 4,
  "164": 11,
  "165": 7,
  "166": 19,
  "167": 4,
  "168": 11,
  "169": 9,
  "170": 4,
  "171": 23,
  "172": 36,
  "173": 4,
  "174": 9,
  "175": 11,
  "176": 14,
  "177": 8,
  "178": 15,
  "179": 11,
  "180": 9,
  "181": 9,
  "182": 4,
  "183": 4,
  "184": 9,
  "185": 8,
  "186": 9,
  "187": 11,
  "188": 16,
  "189": 4,
  "190": 18,
  "191": 10,
  "192": 15,
  "193": 4,
  "194": 14,
  "195": 4,
  "196": 11,
  "197": 9,
  "198": 4,
  "199": 4,
  "200": 15,
  "201": 9,
  "202": 9,
  "203": 4,
  "204": 7,
  "205": 4,
  "206": 4,
  "207": 16,
  "208": 9,
  "209": 4,
  "210": 4,
  "211": 4,
  "212": 8,
  "213": 4,
  "214": 4,
  "215": 14,
  "216": 4,
  "217": 4,
  "218": 4,
  "219": 4,
  "220": 4,
  "221": 8,
  "222": 9,
  "223": 4,
  "224": 25,
  "225": 4,
  "226": 16,
  "227": 21,
  "228": 9,
  "229": 4,
  "230": 9,
  "231": 23,
  "232": 9,
  "233": 4,
  "234": 16,
  "235": 30,
  "236": 9,
  "237": 4,
  "238": 9,
  "239": 4,
  "240": 4,
  "241": 18,
  "242": 4,
  "243": 22,
  "244": 22,
  "245": 4,
  "246": 9,
  "247": 16,
  "248": 9,
  "249": 4,
  "250": 7,
  "251": 9,
  "252": 4,
  "253": 21,
  "254": 9,
  "255": 21,
  "256": 4,
  "257": 34,
  "258": 21,
  "259": 4,
  "260": 37,
  "261": 4,
  "262": 4,
  "263": 14,
  "264": 4,
  "265": 9,
  "266": 4,
  "267": 15,
  "268": 21,
  "269": 6,
  "270": 4,
  "271": 4,
  "272": 23,
  "273": 9,
  "274": 9,
  "275": 4,
  "276": 21,
  "277": 9,
  "278": 4,
  "279": 33,
  "280": 14,
  "281": 39,
  "282": 9,
  "283": 14,
  "284": 23,
  "285": 9,
  "286": 4,
  "287": 4,
  "288": 8,
  "289": 23,
  "290": 4,
  "291": 4,
  "292": 16,
  "293": 10,
  "294": 11,
  "295": 11,
  "296": 25,
  "297": 16,
  "298": 6,
  "299": 16,
  "300": 9,
  "301": 4,
  "302": 9,
  "303": 16,
  "304": 4,
  "305": 4,
  "306": 10,
  "307": 9,
  "308": 11,
  "309": 9,
  "310": 15,
  "311": 14,
  "312": 4,
  "313": 4,
  "314": 23,
  "315": 4,
  "316": 4,
  "317": 4,
  "318": 4,
  "319": 16,
  "320": 15,
  "321": 4,
  "322": 8,
  "323": 4,
  "324": 14,
  "325": 11,
  "326": 18,
  "327": 10,
  "328": 9,
  "329": 4,
  "330": 9,
  "331": 4,
  "332": 4,
  "333": 8,
  "334": 11,
  "335": 4,
  "336": 4,
  "337": 8,
  "338": 4,
  "339": 18,
  "340": 4,
  "341": 4,
  "342": 4,
  "343": 4,
  "344": 14,
  "345": 4,
  "346": 38,
  "347": 9,
  "348": 9,
  "349": 23,
  "350": 21,
  "351": 9,
  "352": 15,
  "353": 4,
  "354": 11,
  "355": 9,
  "356": 25,
  "357": 11,
  "358": 10,
  "359": 7,
  "360": 8,
  "361": 40,
  "362": 4,
  "363": 15,
  "364": 19,
  "365": 4,
  "366": 4,
  "367": 23,
  "368": 11,
  "369": 9,
  "370": 4,
  "371": 4,
  "372": 4,
  "373": 18,
  "374": 9,
  "375": 15,
  "376": 4,
  "377": 4,
  "378": 8,
  "379": 23,
  "380": 4,
  "381": 11,
  "382": 21,
  "383": 4,
  "384": 9,
  "385": 4,
  "386": 11,
  "387": 4,
  "388": 9,
  "389": 4,
  "390": 4,
  "391": 10,
  "392": 7,
  "393": 16,
  "394": 4,
  "395": 4,
  "396": 9,
  "397": 4,
  "398": 4,
  "399": 15,
  "400": 18,
  "401": 4,
  "402": 9,
  "403": 9,
  "404": 4,
  "405": 4,
  "406": 14,
  "407": 25,
  "408": 4,
  "409": 4,
  "410": 11,
  "411": 9,
  "412": 4,
  "413": 4,
  "414": 9,
  "415": 15,
  "416": 4,
  "417": 4,
  "418": 23,
  "419": 9,
  "420": 21,
  "421": 21,
  "422": 9,
  "423": 4,
  "424": 18,
  "425": 9,
  "426": 15,
  "427": 11,
  "428": 21,
  "429": 4,
  "430": 4,
  "431": 16,
  "432": 41,
  "433": 23,
  "434": 15,
  "435": 10,
  "436": 9,
  "437": 4,
  "438": 4,
  "439": 9,
  "440": 9,
  "441": 4,
  "442": 15,
  "443": 4,
  "444": 18,
  "445": 14,
  "446": 4,
  "447": 4,
  "448": 11,
  "449": 13,
  "450": 8,
  "451": 4,
  "452": 15,
  "453": 14,
  "454": 15,
  "455": 4,
  "456": 4,
  "457": 11,
  "458": 4,
  "459": 4,
  "460": 9,
  "461": 4,
  "462": 18,
  "463": 18,
  "464": 9,
  "465": 8,
  "466": 8,
  "467": 4,
  "468": 21,
  "469": 18,
  "470": 11,
  "471": 23,
  "472": 4,
  "473": 4,
  "474": 21,
  "475": 11,
  "476": 15,
  "477": 14,
  "478": 4,
  "479": 4,
  "480": 4,
  "481": 9,
  "482": 9,
  "483": 34,
  "484": 9,
  "485": 4,
  "486": 11,
  "487": 23,
  "488": 4,
  "489": 4,
  "490": 4,
  "491": 25,
  "492": 4,
  "493": 4,
  "494": 22,
  "495": 10,
  "496": 4,
  "497": 9,
  "498": 4,
  "499": 15,
  "500": 21,
  "501": 9,
  "502": 8,
  "503": 25,
  "504": 9,
  "505": 9,
  "506": 4,
  "507": 4,
  "508": 4,
  "509": 33,
  "510": 25,
  "511": 9,
  "512": 4,
  "513": 16,
  "514": 15,
  "515": 16,
  "516": 11,
  "517": 9,
  "518": 4,
  "519": 15,
  "520": 14,
  "521": 4,
  "522": 8,
  "523": 4,
  "524": 14,
  "525": 9,
  "526": 4,
  "527": 16,
  "528": 9,
  "529": 11,
  "530": 21,
  "531": 20,
  "532": 11,
  "533": 10,
  "534": 9,
  "535": 9,
  "536": 4,
  "537": 4,
  "538": 4,
  "539": 4,
  "540": 4,
  "541": 25,
  "542": 9,
  "543": 4,
  "544": 9,
  "545": 4,
  "546": 16,
  "547": 9,
  "548": 4,
  "549": 16,
  "550": 4,
  "551": 14,
  "552": 21,
  "553": 4,
  "554": 4,
  "555": 4,
  "556": 10,
  "557": 9,
  "558": 4,
  "559": 4,
  "560": 4,
  "561": 4,
  "562": 4,
  "563": 9,
  "564": 4,
  "565": 9,
  "566": 8,
  "567": 9,
  "568": 15,
  "569": 9,
  "570": 32,
  "571": 4,
  "572": 25,
  "573": 4,
  "574": 9,
  "575": 4,
  "576": 25,
  "577": 18,
  "578": 25,
  "579": 4,
  "580": 4,
  "581": 4,
  "582": 21,
  "583": 9,
  "584": 4,
  "585": 21,
  "586": 4,
  "587": 4,
  "588": 18,
  "589": 39,
  "590": 4,
  "591": 18,
  "592": 9,
  "593": 4,
  "594": 23,
  "595": 9,
  "596": 9,
  "597": 15,
  "598": 6,
  "599": 15,
  "600": 14,
  "601": 9,
  "602": 9,
  "603": 9,
  "604": 4,
  "605": 16,
  "606": 9,
  "607": 9,
  "608": 21,
  "609": 9,
  "610": 4,
  "611": 16,
  "612": 11,
  "613": 9,
  "614": 14,
  "615": 9,
  "616": 9,
  "617": 4,
  "618": 4,
  "619": 25,
  "620": 25,
  "621": 4,
  "622": 9,
  "623": 25,
  "624": 4,
  "625": 4,
  "626": 11,
  "627": 9,
  "628": 18,
  "629": 9,
  "630": 4,
  "631": 4,
  "632": 14,
  "633": 25,
  "634": 9,
  "635": 4,
  "636": 16,
  "637": 4,
  "638": 9,
  "639": 15,
  "640": 14,
  "641": 4,
  "642": 11,
  "643": 9,
  "644": 9,
  "645": 4,
  "646": 23,
  "647": 4,
  "648": 4,
  "649": 4,
  "650": 14,
  "651": 4,
  "652": 9,
  "653": 4,
  "654": 9,
  "655": 4,
  "656": 4,
  "657": 18,
  "658": 15,
  "659": 4,
  "660": 11,
  "661": 16,
  "662": 9,
  "663": 4,
  "664": 4,
  "665": 8,
  "666": 4,
  "667": 4,
  "668": 9,
  "669": 15,
  "670": 21,
  "671": 9,
  "672": 4,
  "673": 4,
  "674": 4,
  "675": 4,
  "676": 4,
  "677": 4,
  "678": 21,
  "679": 4,
  "680": 4,
  "681": 4,
  "682": 16,
  "683": 15,
  "684": 14,
  "685": 10,
  "686": 9,
  "687": 21,
  "688": 9,
  "689": 4,
  "690": 4,
  "691": 9,
  "692": 15,
  "693": 4,
  "694": 4,
  "695": 4,
  "696": 4,
  "697": 16,
  "698": 9,
  "699": 32,
  "700": 9,
  "701": 4,
  "702": 4,
  "703": 4,
  "704": 4,
  "705": 4,
  "706": 4,
  "707": 9,
  "708": 4,
  "709": 21,
  "710": 16,
  "711": 4,
  "712": 11,
  "713": 25,
  "714": 9,
  "715": 15,
  "716": 21,
  "717": 9,
  "718": 15,
  "719": 14,
  "720": 11,
  "721": 23,
  "722": 4,
  "723": 11,
  "724": 23,
  "725": 4,
  "726": 4,
  "727": 4,
  "728": 9,
  "729": 4,
  "730": 4,
  "731": 4,
  "732": 16,
  "733": 9,
  "734": 21,
  "735": 9,
  "736": 21,
  "737": 21,
  "738": 9,
  "739": 4,
  "740": 36,
  "741": 9,
  "742": 15,
  "743": 14,
  "744": 15,
  "745": 14,
  "746": 9,
  "747": 4,
  "748": 4,
  "749": 9,
  "750": 23,
  "751": 9,
  "752": 4,
  "753": 25,
  "754": 14,
  "755": 25,
  "756": 9,
  "757": 4,
  "758": 25,
  "759": 9,
  "760": 9,
  "761": 4,
  "762": 4,
  "763": 8,
  "764": 15,
  "765": 14,
  "766": 9,
  "767": 14,
  "768": 4,
  "769": 4,
  "770": 15,
  "771": 21,
  "772": 4,
  "773": 16,
  "774": 15,
  "775": 8,
  "776": 8,
  "777": 9,
  "778": 16,
  "779": 4,
  "780": 16,
  "781": 15,
  "782": 9,
  "783": 32,
  "784": 4,
  "785": 4,
  "786": 4,
  "787": 9,
  "788": 4,
  "789": 4,
  "790": 9,
  "791": 4,
  "792": 11,
  "793": 4,
  "794": 9,
  "795": 9,
  "796": 9,
  "797": 4,
  "798": 4,
  "799": 16,
  "800": 11,
  "801": 9,
  "802": 9,
  "803": 4,
  "804": 25,
  "805": 4,
  "806": 38,
  "807": 4,
  "808": 4,
  "809": 9,
  "810": 15,
  "811": 4,
  "812": 9,
  "813": 9,
  "814": 25,
  "815": 4,
  "816": 23,
  "817": 9,
  "818": 9,
  "819": 4,
  "820": 4,
  "821": 9,
  "822": 4,
  "823": 4,
  "824": 23,
  "825": 4,
  "826": 18,
  "827": 9,
  "828": 4,
  "829": 4,
  "830": 4,
  "831": 11,
  "832": 11,
  "833": 14,
  "834": 25,
  "835": 4,
  "836": 8,
  "837": 9,
  "838": 9,
  "839": 9,
  "840": 4,
  "841": 4,
  "842": 8,
  "843": 9,
  "844": 4,
  "845": 4,
  "846": 4,
  "847": 11,
  "848": 9,
  "849": 15,
  "850": 21,
  "851": 9,
  "852": 4,
  "853": 4,
  "854": 9,
  "855": 4,
  "856": 16,
  "857": 4,
  "858": 4,
  "859": 9,
  "860": 4,
  "861": 4,
  "862": 4,
  "863": 4,
  "864": 21,
  "865": 4,
  "866": 4,
  "867": 9,
  "868": 4,
  "869": 21,
  "870": 4,
  "871": 14,
  "872": 4,
  "873": 25,
  "874": 4,
  "875": 9,
  "876": 4,
  "877": 25,
  "878": 4,
  "879": 9,
  "880": 4,
  "881": 9,
  "882": 4,
  "883": 4,
  "884": 9,
  "885": 15,
  "886": 9,
  "887": 4,
  "888": 15,
  "889": 9,
  "890": 9,
  "891": 21,
  "892": 9,
  "893": 4,
  "894": 9,
  "895": 15,
  "896": 14,
  "897": 4,
  "898": 21,
  "899": 16,
  "900": 9,
  "901": 4,
  "902": 21,
  "903": 9,
  "904": 4,
  "905": 16,
  "906": 11,
  "907": 21,
  "908": 4,
  "909": 16,
  "910": 9,
  "911": 9,
  "912": 4,
  "913": 21,
  "914": 9,
  "915": 9,
  "916": 4,
  "917": 4,
  "918": 16,
  "919": 4,
  "920": 4,
  "921": 8,
  "922": 4,
  "923": 15,
  "924": 14,
  "925": 9,
  "926": 4,
  "927": 9,
  "928": 4,
  "929": 4,
  "930": 4,
  "931": 9,
  "932": 9,
  "933": 11,
  "934": 4,
  "935": 4,
  "936": 4,
  "937": 4,
  "938": 14,
  "939": 4,
  "940": 9,
  "941": 4,
  "942": 4,
  "943": 4,
  "944": 4,
  "945": 4,
  "946": 21,
  "947": 9,
  "948": 4,
  "949": 4,
  "950": 21,
  "951": 9,
  "952": 9,
  "953": 4,
  "954": 4,
  "955": 15,
  "956": 16,
  "957": 9,
  "958": 4,
  "959": 16,
  "960": 23,
  "961": 11,
  "962": 9,
  "963": 4,
  "964": 14,
  "965": 4,
  "966": 4,
  "967": 9,
  "968": 4,
  "969": 8,
  "970": 23,
  "971": 16,
  "972": 4,
  "973": 8,
  "974": 4,
  "975": 4,
  "976": 11,
  "977": 16,
  "978": 4,
  "979": 4,
  "980": 9,
  "981": 16,
  "982": 15,
  "983": 10,
  "984": 21,
  "985": 9,
  "986": 4,
  "987": 25,
  "988": 9,
  "989": 4,
  "990": 4,
  "991": 4,
  "992": 4,
  "993": 16,
  "994": 16,
  "995": 4,
  "996": 4,
  "997": 4,
  "998": 4,
  "999": 9,
  "1000": 4,
  "1001": 4,
  "1002": 9,
  "1003": 4,
  "1004": 4,
  "1005": 4,
  "1006": 15,
  "1007": 14,
  "1008": 4,
  "1009": 9,
  "1010": 4,
  "1011": 4,
  "1012": 4,
  "1013": 4,
  "1014": 16,
  "1015": 9,
  "1016": 4,
  "1017": 18,
  "1018": 4,
  "1019": 4,
  "1020": 18,
  "1021": 4,
  "1022": 9,
  "1023": 4,
  "1024": 16,
  "1025": 25,
  "1026": 4,
  "1027": 9,
  "1028": 4,
  "1029": 4,
  "1030": 21,
  "1031": 11,
  "1032": 4,
  "1033": 9,
  "1034": 16,
  "1035": 9,
  "1036": 4,
  "1037": 15,
  "1038": 14,
  "1039": 9,
  "1040": 4,
  "1041": 21,
  "1042": 4,
  "1043": 9,
  "1044": 4,
  "1045": 4,
  "1046": 4,
  "1047": 4,
  "1048": 47,
  "1049": 4,
  "1050": 9,
  "1051": 15,
  "1052": 21,
  "1053": 9,
  "1054": 4,
  "1055": 4,
  "1056": 4,
  "1057": 4,
  "1058": 4,
  "1059": 4,
  "1060": 9,
  "1061": 4,
  "1062": 4,
  "1063": 23,
  "1064": 4,
  "1065": 21,
  "1066": 8,
  "1067": 4,
  "1068": 21,
  "1069": 4,
  "1070": 34,
  "1071": 8,
  "1072": 9,
  "1073": 4,
  "1074": 16,
  "1075": 4,
  "1076": 25,
  "1077": 4,
  "1078": 15,
  "1079": 14,
  "1080": 9,
  "1081": 4,
  "1082": 34,
  "1083": 25,
  "1084": 9,
  "1085": 4,
  "1086": 21,
  "1087": 25,
  "1088": 4,
  "1089": 4,
  "1090": 4,
  "1091": 4,
  "1092": 4,
  "1093": 4,
  "1094": 4,
  "1095": 26,
  "1096": 4,
  "1097": 4,
  "1098": 4,
  "1099": 4,
  "1100": 11,
  "1101": 4,
  "1102": 4,
  "1103": 18,
  "1104": 6,
  "1105": 9,
  "1106": 15,
  "1107": 9,
  "1108": 9,
  "1109": 4,
  "1110": 4,
  "1111": 16,
  "1112": 4,
  "1113": 4,
  "1114": 16,
  "1115": 9,
  "1116": 4,
  "1117": 14,
  "1118": 8,
  "1119": 8,
  "1120": 21,
  "1121": 6,
  "1122": 15,
  "1123": 9,
  "1124": 15,
  "1125": 4,
  "1126": 4,
  "1127": 4,
  "1128": 11,
  "1129": 21,
  "1130": 15,
  "1131": 16,
  "1132": 9,
  "1133": 4,
  "1134": 4,
  "1135": 21,
  "1136": 9,
  "1137": 4,
  "1138": 11,
  "1139": 11,
  "1140": 9,
  "1141": 4,
  "1142": 4,
  "1143": 4,
  "1144": 11,
  "1145": 18,
  "1146": 4,
  "1147": 23,
  "1148": 15,
  "1149": 22,
  "1150": 15,
  "1151": 10,
  "1152": 9,
  "1153": 15,
  "1154": 34,
  "1155": 4,
  "1156": 4,
  "1157": 10,
  "1158": 4,
  "1159": 15,
  "1160": 9,
  "1161": 9,
  "1162": 21,
  "1163": 9,
  "1164": 4,
  "1165": 4,
  "1166": 8,
  "1167": 4,
  "1168": 11,
  "1169": 15,
  "1170": 11,
  "1171": 14,
  "1172": 4,
  "1173": 4,
  "1174": 4,
  "1175": 16,
  "1176": 15,
  "1177": 16,
  "1178": 9,
  "1179": 4,
  "1180": 11,
  "1181": 9,
  "1182": 9,
  "1183": 4,
  "1184": 9,
  "1185": 9,
  "1186": 4,
  "1187": 32,
  "1188": 15,
  "1189": 14,
  "1190": 23,
  "1191": 11,
  "1192": 9,
  "1193": 4,
  "1194": 4,
  "1195": 15,
  "1196": 9,
  "1197": 42,
  "1198": 15,
  "1199": 14,
  "1200": 4,
  "1201": 4,
  "1202": 15,
  "1203": 14,
  "1204": 4,
  "1205": 4,
  "1206": 4,
  "1207": 21,
  "1208": 9,
  "1209": 9,
  "1210": 4,
  "1211": 6,
  "1212": 18,
  "1213": 4,
  "1214": 9,
  "1215": 4,
  "1216": 4,
  "1217": 4,
  "1218": 4,
  "1219": 21,
  "1220": 4,
  "1221": 4,
  "1222": 16,
  "1223": 9,
  "1224": 9,
  "1225": 21,
  "1226": 11,
  "1227": 9,
  "1228": 9,
  "1229": 4,
  "1230": 4,
  "1231": 20,
  "1232": 4,
  "1233": 4,
  "1234": 9,
  "1235": 8,
  "1236": 9,
  "1237": 21,
  "1238": 21,
  "1239": 15,
  "1240": 11,
  "1241": 9,
  "1242": 4,
  "1243": 10,
  "1244": 9,
  "1245": 15,
  "1246": 9,
  "1247": 4,
  "1248": 4,
  "1249": 11,
  "1250": 9,
  "1251": 15,
  "1252": 4,
  "1253": 23,
  "1254": 4,
  "1255": 9,
  "1256": 4,
  "1257": 4,
  "1258": 4,
  "1259": 4,
  "1260": 15,
  "1261": 21,
  "1262": 9,
  "1263": 4,
  "1264": 9,
  "1265": 15,
  "1266": 14,
  "1267": 4,
  "1268": 34,
  "1269": 11,
  "1270": 9,
  "1271": 9,
  "1272": 4,
  "1273": 16,
  "1274": 4,
  "1275": 9,
  "1276": 4,
  "1277": 9,
  "1278": 4,
  "1279": 4,
  "1280": 4,
  "1281": 4,
  "1282": 4,
  "1283": 4,
  "1284": 4,
  "1285": 4,
  "1286": 4,
  "1287": 25,
  "1288": 4,
  "1289": 4,
  "1290": 4,
  "1291": 4,
  "1292": 4,
  "1293": 21,
  "1294": 4,
  "1295": 16,
  "1296": 6,
  "1297": 4,
  "1298": 21,
  "1299": 4,
  "1300": 15,
  "1301": 11,
  "1302": 14,
  "1303": 23,
  "1304": 4,
  "1305": 8,
  "1306": 36,
  "1307": 4,
  "1308": 11,
  "1309": 11,
  "1310": 11,
  "1311": 9,
  "1312": 15,
  "1313": 14,
  "1314": 4,
  "1315": 4,
  "1316": 4,
  "1317": 4,
  "1318": 11,
  "1319": 18,
  "1320": 9,
  "1321": 4,
  "1322": 15,
  "1323": 11,
  "1324": 14,
  "1325": 9,
  "1326": 4,
  "1327": 8,
  "1328": 15,
  "1329": 9,
  "1330": 15,
  "1331": 9,
  "1332": 9,
  "1333": 4,
  "1334": 4,
  "1335": 16,
  "1336": 9,
  "1337": 9,
  "1338": 11,
  "1339": 14,
  "1340": 32,
  "1341": 9,
  "1342": 4,
  "1343": 4,
  "1344": 4,
  "1345": 4,
  "1346": 15,
  "1347": 14,
  "1348": 21,
  "1349": 9,
  "1350": 11,
  "1351": 15,
  "1352": 14,
  "1353": 9,
  "1354": 4,
  "1355": 4,
  "1356": 21,
  "1357": 16,
  "1358": 9,
  "1359": 4,
  "1360": 15,
  "1361": 25,
  "1362": 4,
  "1363": 9,
  "1364": 23,
  "1365": 9,
  "1366": 11,
  "1367": 14,
  "1368": 9,
  "1369": 4,
  "1370": 9,
  "1371": 4,
  "1372": 4,
  "1373": 4,
  "1374": 20,
  "1375": 4,
  "1376": 4,
  "1377": 4,
  "1378": 9,
  "1379": 4,
  "1380": 9,
  "1381": 9,
  "1382": 4,
  "1383": 18,
  "1384": 14,
  "1385": 11,
  "1386": 9,
  "1387": 9,
  "1388": 4,
  "1389": 4,
  "1390": 9,
  "1391": 16,
  "1392": 15,
  "1393": 4,
  "1394": 6,
  "1395": 9,
  "1396": 15,
  "1397": 18,
  "1398": 11,
  "1399": 9,
  "1400": 4,
  "1401": 4,
  "1402": 8,
  "1403": 4,
  "1404": 9,
  "1405": 4,
  "1406": 4,
  "1407": 4,
  "1408": 4,
  "1409": 4,
  "1410": 15,
  "1411": 16,
  "1412": 23,
  "1413": 15,
  "1414": 15,
  "1415": 16,
  "1416": 4,
  "1417": 4,
  "1418": 4,
  "1419": 16,
  "1420": 4,
  "1421": 4,
  "1422": 4,
  "1423": 20,
  "1424": 9,
  "1425": 4,
  "1426": 9,
  "1427": 34,
  "1428": 15,
  "1429": 14,
  "1430": 9,
  "1431": 11,
  "1432": 4,
  "1433": 9,
  "1434": 4,
  "1435": 21,
  "1436": 25,
  "1437": 9,
  "1438": 23,
  "1439": 4,
  "1440": 4,
  "1441": 21,
  "1442": 21,
  "1443": 4,
  "1444": 10,
  "1445": 4,
  "1446": 4,
  "1447": 9,
  "1448": 11,
  "1449": 9,
  "1450": 4,
  "1451": 25,
  "1452": 4,
  "1453": 21,
  "1454": 4,
  "1455": 4,
  "1456": 15,
  "1457": 16,
  "1458": 4,
  "1459": 15,
  "1460": 4,
  "1461": 14,
  "1462": 9,
  "1463": 21,
  "1464": 36,
  "1465": 9,
  "1466": 4,
  "1467": 15,
  "1468": 14,
  "1469": 4,
  "1470": 4,
  "1471": 4,
  "1472": 4,
  "1473": 18,
  "1474": 4,
  "1475": 4,
  "1476": 4,
  "1477": 4,
  "1478": 4,
  "1479": 9,
  "1480": 4,
  "1481": 4,
  "1482": 9,
  "1483": 4,
  "1484": 4,
  "1485": 18,
  "1486": 11,
  "1487": 23,
  "1488": 14,
  "1489": 21,
  "1490": 4,
  "1491": 21,
  "1492": 4,
  "1493": 4,
  "1494": 9,
  "1495": 9,
  "1496": 4,
  "1497": 4,
  "1498": 21,
  "1499": 9,
  "1500": 4,
  "1501": 23,
  "1502": 15,
  "1503": 16,
  "1504": 4,
  "1505": 21,
  "1506": 15,
  "1507": 15,
  "1508": 11,
  "1509": 14,
  "1510": 9,
  "1511": 4,
  "1512": 16,
  "1513": 32,
  "1514": 4,
  "1515": 4,
  "1516": 16,
  "1517": 9,
  "1518": 15,
  "1519": 14,
  "1520": 9,
  "1521": 16,
  "1522": 4,
  "1523": 4,
  "1524": 21,
  "1525": 16,
  "1526": 4,
  "1527": 4,
  "1528": 21,
  "1529": 4,
  "1530": 4,
  "1531": 16,
  "1532": 32,
  "1533": 9,
  "1534": 4,
  "1535": 24,
  "1536": 18,
  "1537": 9,
  "1538": 4,
  "1539": 16,
  "1540": 16,
  "1541": 23,
  "1542": 9,
  "1543": 4,
  "1544": 9,
  "1545": 25,
  "1546": 4,
  "1547": 4,
  "1548": 4,
  "1549": 4,
  "1550": 11,
  "1551": 9,
  "1552": 15,
  "1553": 14,
  "1554": 9,
  "1555": 9,
  "1556": 4,
  "1557": 16,
  "1558": 9,
  "1559": 15,
  "1560": 11,
  "1561": 9,
  "1562": 4,
  "1563": 4,
  "1564": 16,
  "1565": 9,
  "1566": 9,
  "1567": 4,
  "1568": 4,
  "1569": 23,
  "1570": 14,
  "1571": 4,
  "1572": 4,
  "1573": 4,
  "1574": 9,
  "1575": 4,
  "1576": 9,
  "1577": 9,
  "1578": 4,
  "1579": 15,
  "1580": 14,
  "1581": 9,
  "1582": 14,
  "1583": 9,
  "1584": 4,
  "1585": 4,
  "1586": 4,
  "1587": 4,
  "1588": 10,
  "1589": 9,
  "1590": 4,
  "1591": 4,
  "1592": 9,
  "1593": 4,
  "1594": 15,
  "1595": 4,
  "1596": 9,
  "1597": 9,
  "1598": 4,
  "1599": 4,
  "1600": 4,
  "1601": 16,
  "1602": 4,
  "1603": 36,
  "1604": 9,
  "1605": 4,
  "1606": 8,
  "1607": 9,
  "1608": 15,
  "1609": 9,
  "1610": 4,
  "1611": 4,
  "1612": 16,
  "1613": 10,
  "1614": 9,
  "1615": 15,
  "1616": 11,
  "1617": 8,
  "1618": 9,
  "1619": 9,
  "1620": 4,
  "1621": 21,
  "1622": 4,
  "1623": 4,
  "1624": 9,
  "1625": 4,
  "1626": 4,
  "1627": 4,
  "1628": 4,
  "1629": 14,
  "1630": 14,
  "1631": 9,
  "1632": 4,
  "1633": 23,
  "1634": 9,
  "1635": 4,
  "1636": 4,
  "1637": 15,
  "1638": 14,
  "1639": 9,
  "1640": 40,
  "1641": 4,
  "1642": 4,
  "1643": 11,
  "1644": 9,
  "1645": 21,
  "1646": 9,
  "1647": 8,
  "1648": 9,
  "1649": 9,
  "1650": 21,
  "1651": 9,
  "1652": 4,
  "1653": 16,
  "1654": 15,
  "1655": 14,
  "1656": 9,
  "1657": 15,
  "1658": 21,
  "1659": 4,
  "1660": 4,
  "1661": 16,
  "1662": 4,
  "1663": 4,
  "1664": 11,
  "1665": 9,
  "1666": 21,
  "1667": 4,
  "1668": 9,
  "1669": 9,
  "1670": 8,
  "1671": 9,
  "1672": 4,
  "1673": 4,
  "1674": 4,
  "1675": 18,
  "1676": 15,
  "1677": 9,
  "1678": 11,
  "1679": 23,
  "1680": 4,
  "1681": 4,
  "1682": 4,
  "1683": 4,
  "1684": 32,
  "1685": 9,
  "1686": 4,
  "1687": 4,
  "1688": 4,
  "1689": 18,
  "1690": 4,
  "1691": 4,
  "1692": 4,
  "1693": 4,
  "1694": 16,
  "1695": 9,
  "1696": 15,
  "1697": 9,
  "1698": 4,
  "1699": 23,
  "1700": 4,
  "1701": 11,
  "1702": 4,
  "1703": 15,
  "1704": 9,
  "1705": 4,
  "1706": 9,
  "1707": 9,
  "1708": 15,
  "1709": 14,
  "1710": 9,
  "1711": 4,
  "1712": 10,
  "1713": 21,
  "1714": 9,
  "1715": 25,
  "1716": 4,
  "1717": 23,
  "1718": 11,
  "1719": 9,
  "1720": 4,
  "1721": 9,
  "1722": 9,
  "1723": 4,
  "1724": 4,
  "1725": 4,
  "1726": 4,
  "1727": 4,
  "1728": 32,
  "1729": 15,
  "1730": 11,
  "1731": 14,
  "1732": 9,
  "1733": 23,
  "1734": 4,
  "1735": 21,
  "1736": 9,
  "1737": 15,
  "1738": 11,
  "1739": 14,
  "1740": 9,
  "1741": 4,
  "1742": 4,
  "1743": 4,
  "1744": 4,
  "1745": 15,
  "1746": 14,
  "1747": 9,
  "1748": 4,
  "1749": 4,
  "1750": 16,
  "1751": 15,
  "1752": 9,
  "1753": 4,
  "1754": 9,
  "1755": 9,
  "1756": 4,
  "1757": 11,
  "1758": 18,
  "1759": 4,
  "1760": 23,
  "1761": 16,
  "1762": 21,
  "1763": 16,
  "1764": 4,
  "1765": 4,
  "1766": 16,
  "1767": 9,
  "1768": 4,
  "1769": 16,
  "1770": 9,
  "1771": 4,
  "1772": 16,
  "1773": 9,
  "1774": 4,
  "1775": 4,
  "1776": 4,
  "1777": 4,
  "1778": 4,
  "1779": 4,
  "1780": 4,
  "1781": 4,
  "1782": 21,
  "1783": 36,
  "1784": 9,
  "1785": 4,
  "1786": 26,
  "1787": 4,
  "1788": 18,
  "1789": 21,
  "1790": 4,
  "1791": 4,
  "1792": 15,
  "1793": 15,
  "1794": 4,
  "1795": 4,
  "1796": 4,
  "1797": 4,
  "1798": 21,
  "1799": 9,
  "1800": 4,
  "1801": 9,
  "1802": 16,
  "1803": 9,
  "1804": 8,
  "1805": 4,
  "1806": 9,
  "1807": 4,
  "1808": 4,
  "1809": 4,
  "1810": 4,
  "1811": 18,
  "1812": 9,
  "1813": 15,
  "1814": 14,
  "1815": 9,
  "1816": 15,
  "1817": 14,
  "1818": 14,
  "1819": 4,
  "1820": 23,
  "1821": 4,
  "1822": 16,
  "1823": 15,
  "1824": 21,
  "1825": 9,
  "1826": 4,
  "1827": 4,
  "1828": 21,
  "1829": 21,
  "1830": 4,
  "1831": 20,
  "1832": 4,
  "1833": 4,
  "1834": 15,
  "1835": 9,
  "1836": 16,
  "1837": 32,
  "1838": 9,
  "1839": 4,
  "1840": 9,
  "1841": 4,
  "1842": 4,
  "1843": 4,
  "1844": 4,
  "1845": 4,
  "1846": 9,
  "1847": 4,
  "1848": 21,
  "1849": 23,
  "1850": 21,
  "1851": 9,
  "1852": 15,
  "1853": 14,
  "1854": 8,
  "1855": 25,
  "1856": 9,
  "1857": 4,
  "1858": 4,
  "1859": 4,
  "1860": 4,
  "1861": 11,
  "1862": 25,
  "1863": 9,
  "1864": 4,
  "1865": 34,
  "1866": 4,
  "1867": 4,
  "1868": 9,
  "1869": 15,
  "1870": 25,
  "1871": 15,
  "1872": 11,
  "1873": 14,
  "1874": 4,
  "1875": 4,
  "1876": 4,
  "1877": 4,
  "1878": 16,
  "1879": 4,
  "1880": 23,
  "1881": 4,
  "1882": 25,
  "1883": 4,
  "1884": 4,
  "1885": 34,
  "1886": 15,
  "1887": 11,
  "1888": 4,
  "1889": 9,
  "1890": 4,
  "1891": 4,
  "1892": 4,
  "1893": 15,
  "1894": 4,
  "1895": 8,
  "1896": 9,
  "1897": 9,
  "1898": 15,
  "1899": 14,
  "1900": 9,
  "1901": 15,
  "1902": 16,
  "1903": 21,
  "1904": 23,
  "1905": 15,
  "1906": 21,
  "1907": 15,
  "1908": 16,
  "1909": 21,
  "1910": 4,
  "1911": 9,
  "1912": 15,
  "1913": 14,
  "1914": 9,
  "1915": 15,
  "1916": 18,
  "1917": 15,
  "1918": 4,
  "1919": 4,
  "1920": 15,
  "1921": 14,
  "1922": 15,
  "1923": 14,
  "1924": 11,
  "1925": 11,
  "1926": 4,
  "1927": 16,
  "1928": 18,
  "1929": 9,
  "1930": 15,
  "1931": 16,
  "1932": 9,
  "1933": 4,
  "1934": 4,
  "1935": 16,
  "1936": 23,
  "1937": 4,
  "1938": 4,
  "1939": 4,
  "1940": 4,
  "1941": 4,
  "1942": 16,
  "1943": 9,
  "1944": 4,
  "1945": 4,
  "1946": 15,
  "1947": 14,
  "1948": 9,
  "1949": 4,
  "1950": 4,
  "1951": 4,
  "1952": 18,
  "1953": 11,
  "1954": 9,
  "1955": 4,
  "1956": 4,
  "1957": 4,
  "1958": 40,
  "1959": 16,
  "1960": 11,
  "1961": 9,
  "1962": 15,
  "1963": 9,
  "1964": 15,
  "1965": 36,
  "1966": 9,
  "1967": 25,
  "1968": 9,
  "1969": 9,
  "1970": 4,
  "1971": 4,
  "1972": 4,
  "1973": 9,
  "1974": 11,
  "1975": 18,
  "1976": 15,
  "1977": 4,
  "1978": 14,
  "1979": 21,
  "1980": 4,
  "1981": 4,
  "1982": 15,
  "1983": 14,
  "1984": 25,
  "1985": 9,
  "1986": 4,
  "1987": 4,
  "1988": 4,
  "1989": 4,
  "1990": 4,
  "1991": 9,
  "1992": 4,
  "1993": 16,
  "1994": 4,
  "1995": 15,
  "1996": 14,
  "1997": 9,
  "1998": 9,
  "1999": 4,
  "2000": 9,
  "2001": 4,
  "2002": 4,
  "2003": 9,
  "2004": 4,
  "2005": 4,
  "2006": 4,
  "2007": 4,
  "2008": 23,
  "2009": 15,
  "2010": 16,
  "2011": 4,
  "2012": 4,
  "2013": 9,
  "2014": 25,
  "2015": 9,
  "2016": 37,
  "2017": 8,
  "2018": 15,
  "2019": 14,
  "2020": 21,
  "2021": 9,
  "2022": 9,
  "2023": 4,
  "2024": 16,
  "2025": 11,
  "2026": 23,
  "2027": 4,
  "2028": 4,
  "2029": 9,
  "2030": 4,
  "2031": 15,
  "2032": 4,
  "2033": 4,
  "2034": 18,
  "2035": 32,
  "2036": 15,
  "2037": 9,
  "2038": 16,
  "2039": 9,
  "2040": 4,
  "2041": 15,
  "2042": 16,
  "2043": 9,
  "2044": 25,
  "2045": 4,
  "2046": 4,
  "2047": 4,
  "2048": 4,
  "2049": 16,
  "2050": 9,
  "2051": 4,
  "2052": 25,
  "2053": 15,
  "2054": 16,
  "2055": 15,
  "2056": 4,
  "2057": 18,
  "2058": 9,
  "2059": 4,
  "2060": 4,
  "2061": 9,
  "2062": 9,
  "2063": 4,
  "2064": 4,
  "2065": 16,
  "2066": 21,
  "2067": 4,
  "2068": 16,
  "2069": 9,
  "2070": 4,
  "2071": 4,
  "2072": 9,
  "2073": 21,
  "2074": 4,
  "2075": 4,
  "2076": 9,
  "2077": 21,
  "2078": 15,
  "2079": 8,
  "2080": 21,
  "2081": 15,
  "2082": 18,
  "2083": 4,
  "2084": 15,
  "2085": 14,
  "2086": 24,
  "2087": 11,
  "2088": 15,
  "2089": 14,
  "2090": 15,
  "2091": 21,
  "2092": 9,
  "2093": 4,
  "2094": 4,
  "2095": 16,
  "2096": 9,
  "2097": 4,
  "2098": 4,
  "2099": 8,
  "2100": 21,
  "2101": 4,
  "2102": 4,
  "2103": 4,
  "2104": 16,
  "2105": 9,
  "2106": 4,
  "2107": 4,
  "2108": 15,
  "2109": 16,
  "2110": 15,
  "2111": 15,
  "2112": 14,
  "2113": 9,
  "2114": 9,
  "2115": 9,
  "2116": 9,
  "2117": 4,
  "2118": 21,
  "2119": 4,
  "2120": 11,
  "2121": 23,
  "2122": 4,
  "2123": 4,
  "2124": 4,
  "2125": 4,
  "2126": 4,
  "2127": 4,
  "2128": 9,
  "2129": 4,
  "2130": 4,
  "2131": 4,
  "2132": 11,
  "2133": 9,
  "2134": 4,
  "2135": 4,
  "2136": 15,
  "2137": 4,
  "2138": 4,
  "2139": 4,
  "2140": 15,
  "2141": 16,
  "2142": 4,
  "2143": 4,
  "2144": 16,
  "2145": 4,
  "2146": 4,
  "2147": 15,
  "2148": 14,
  "2149": 9,
  "2150": 4,
  "2151": 15,
  "2152": 21,
  "2153": 11,
  "2154": 4,
  "2155": 34,
  "2156": 4,
  "2157": 4,
  "2158": 16,
  "2159": 11,
  "2160": 23,
  "2161": 9,
  "2162": 4,
  "2163": 16,
  "2164": 8,
  "2165": 9,
  "2166": 9,
  "2167": 4,
  "2168": 14,
  "2169": 11,
  "2170": 9,
  "2171": 9,
  "2172": 4,
  "2173": 9,
  "2174": 4,
  "2175": 16,
  "2176": 18,
  "2177": 21,
  "2178": 4,
  "2179": 4,
  "2180": 4,
  "2181": 4,
  "2182": 4,
  "2183": 4,
  "2184": 9,
  "2185": 4,
  "2186": 4,
  "2187": 4,
  "2188": 9,
  "2189": 4,
  "2190": 16,
  "2191": 15,
  "2192": 14,
  "2193": 4,
  "2194": 4,
  "2195": 4,
  "2196": 21,
  "2197": 9,
  "2198": 4,
  "2199": 9,
  "2200": 25,
  "2201": 9,
  "2202": 4,
  "2203": 15,
  "2204": 21,
  "2205": 32,
  "2206": 9,
  "2207": 15,
  "2208": 4,
  "2209": 16,
  "2210": 23,
  "2211": 4,
  "2212": 4,
  "2213": 32,
  "2214": 16,
  "2215": 4,
  "2216": 9,
  "2217": 9,
  "2218": 21,
  "2219": 4,
  "2220": 9,
  "2221": 15,
  "2222": 21,
  "2223": 4,
  "2224": 4,
  "2225": 15,
  "2226": 14,
  "2227": 4,
  "2228": 16,
  "2229": 21,
  "2230": 4,
  "2231": 4,
  "2232": 15,
  "2233": 4,
  "2234": 14,
  "2235": 4,
  "2236": 4,
  "2237": 4,
  "2238": 15,
  "2239": 14,
  "2240": 15,
  "2241": 9,
  "2242": 14,
  "2243": 9,
  "2244": 4,
  "2245": 4,
  "2246": 4,
  "2247": 4,
  "2248": 21,
  "2249": 4,
  "2250": 4,
  "2251": 9,
  "2252": 9,
  "2253": 9,
  "2254": 4,
  "2255": 4,
  "2256": 4,
  "2257": 4,
  "2258": 4,
  "2259": 4,
  "2260": 4,
  "2261": 4,
  "2262": 18,
  "2263": 11,
  "2264": 9,
  "2265": 16,
  "2266": 9,
  "2267": 9,
  "2268": 9,
  "2269": 15,
  "2270": 14,
  "2271": 9,
  "2272": 9,
  "2273": 14,
  "2274": 4,
  "2275": 4,
  "2276": 4,
  "2277": 9,
  "2278": 9,
  "2279": 4,
  "2280": 23,
  "2281": 18,
  "2282": 4,
  "2283": 4,
  "2284": 9,
  "2285": 4,
  "2286": 4,
  "2287": 4,
  "2288": 4,
  "2289": 21,
  "2290": 4,
  "2291": 9,
  "2292": 4,
  "2293": 4,
  "2294": 4,
  "2295": 11,
  "2296": 16,
  "2297": 9,
  "2298": 15,
  "2299": 4,
  "2300": 4,
  "2301": 4,
  "2302": 4,
  "2303": 4,
  "2304": 15,
  "2305": 14,
  "2306": 9,
  "2307": 23,
  "2308": 4,
  "2309": 4,
  "2310": 4,
  "2311": 4,
  "2312": 9,
  "2313": 23,
  "2314": 11,
  "2315": 9,
  "2316": 4,
  "2317": 4,
  "2318": 8,
  "2319": 15,
  "2320": 21,
  "2321": 9,
  "2322": 4,
  "2323": 15,
  "2324": 4,
  "2325": 14,
  "2326": 9,
  "2327": 4,
  "2328": 4,
  "2329": 9,
  "2330": 4,
  "2331": 16,
  "2332": 4,
  "2333": 4,
  "2334": 4,
  "2335": 9,
  "2336": 4,
  "2337": 4,
  "2338": 4,
  "2339": 4,
  "2340": 11,
  "2341": 9,
  "2342": 9,
  "2343": 32,
  "2344": 4,
  "2345": 15,
  "2346": 16,
  "2347": 9,
  "2348": 9,
  "2349": 15,
  "2350": 14,
  "2351": 9,
  "2352": 4,
  "2353": 4,
  "2354": 4,
  "2355": 16,
  "2356": 4,
  "2357": 4,
  "2358": 15,
  "2359": 14,
  "2360": 9,
  "2361": 4,
  "2362": 4,
  "2363": 4,
  "2364": 4,
  "2365": 9,
  "2366": 21,
  "2367": 21,
  "2368": 9,
  "2369": 15,
  "2370": 14,
  "2371": 4,
  "2372": 15,
  "2373": 14,
  "2374": 11,
  "2375": 9,
  "2376": 9,
  "2377": 4,
  "2378": 4,
  "2379": 4,
  "2380": 11,
  "2381": 9,
  "2382": 21,
  "2383": 9,
  "2384": 15,
  "2385": 4,
  "2386": 9,
  "2387": 11,
  "2388": 10,
  "2389": 4,
  "2390": 4,
  "2391": 4,
  "2392": 14,
  "2393": 32,
  "2394": 15,
  "2395": 4,
  "2396": 14,
  "2397": 11,
  "2398": 23,
  "2399": 15,
  "2400": 14,
  "2401": 4,
  "2402": 4,
  "2403": 9,
  "2404": 4,
  "2405": 4,
  "2406": 4,
  "2407": 18,
  "2408": 9,
  "2409": 15,
  "2410": 14,
  "2411": 15,
  "2412": 4,
  "2413": 14,
  "2414": 4,
  "2415": 4,
  "2416": 9,
  "2417": 4,
  "2418": 4,
  "2419": 4,
  "2420": 4,
  "2421": 11,
  "2422": 9,
  "2423": 4,
  "2424": 9,
  "2425": 9,
  "2426": 4,
  "2427": 15,
  "2428": 18,
  "2429": 14,
  "2430": 9,
  "2431": 15,
  "2432": 9,
  "2433": 4,
  "2434": 4,
  "2435": 4,
  "2436": 4,
  "2437": 4,
  "2438": 15,
  "2439": 4,
  "2440": 14,
  "2441": 21,
  "2442": 4,
  "2443": 11,
  "2444": 14,
  "2445": 21,
  "2446": 21,
  "2447": 15,
  "2448": 16,
  "2449": 4,
  "2450": 4,
  "2451": 4,
  "2452": 4,
  "2453": 8,
  "2454": 21,
  "2455": 15,
  "2456": 9,
  "2457": 16,
  "2458": 4,
  "2459": 4,
  "2460": 4,
  "2461": 18,
  "2462": 9,
  "2463": 15,
  "2464": 9,
  "2465": 9,
  "2466": 4,
  "2467": 4,
  "2468": 4,
  "2469": 9,
  "2470": 4,
  "2471": 4,
  "2472": 4,
  "2473": 4,
  "2474": 16,
  "2475": 9,
  "2476": 23,
  "2477": 7,
  "2478": 4,
  "2479": 21,
  "2480": 9,
  "2481": 4,
  "2482": 9,
  "2483": 9,
  "2484": 4,
  "2485": 15,
  "2486": 14,
  "2487": 4,
  "2488": 4,
  "2489": 23,
  "2490": 4,
  "2491": 21,
  "2492": 16,
  "2493": 9,
  "2494": 4,
  "2495": 16,
  "2496": 4,
  "2497": 4,
  "2498": 15,
  "2499": 14,
  "2500": 9,
  "2501": 4,
  "2502": 15,
  "2503": 14,
  "2504": 4,
  "2505": 23,
  "2506": 9,
  "2507": 15,
  "2508": 9,
  "2509": 15,
  "2510": 8,
  "2511": 21,
  "2512": 15,
  "2513": 9,
  "2514": 15,
  "2515": 15,
  "2516": 14,
  "2517": 15,
  "2518": 21,
  "2519": 4,
  "2520": 4,
  "2521": 4,
  "2522": 15,
  "2523": 14,
  "2524": 15,
  "2525": 11,
  "2526": 9,
  "2527": 4,
  "2528": 4,
  "2529": 4,
  "2530": 4,
  "2531": 4,
  "2532": 4,
  "2533": 18,
  "2534": 9,
  "2535": 21,
  "2536": 4,
  "2537": 4,
  "2538": 4,
  "2539": 4,
  "2540": 4,
  "2541": 4,
  "2542": 4,
  "2543": 4,
  "2544": 4,
  "2545": 4,
  "2546": 15,
  "2547": 16,
  "2548": 4,
  "2549": 4,
  "2550": 15,
  "2551": 14,
  "2552": 9,
  "2553": 15,
  "2554": 14,
  "2555": 15,
  "2556": 9,
  "2557": 15,
  "2558": 14,
  "2559": 9,
  "2560": 9,
  "2561": 4,
  "2562": 4,
  "2563": 4,
  "2564": 9,
  "2565": 34,
  "2566": 4,
  "2567": 4,
  "2568": 4,
  "2569": 4,
  "2570": 15,
  "2571": 23,
  "2572": 4,
  "2573": 11,
  "2574": 16,
  "2575": 4,
  "2576": 4,
  "2577": 4,
  "2578": 4,
  "2579": 9,
  "2580": 4,
  "2581": 16,
  "2582": 15,
  "2583": 14,
  "2584": 4,
  "2585": 16,
  "2586": 15,
  "2587": 9,
  "2588": 9,
  "2589": 4,
  "2590": 4,
  "2591": 9,
  "2592": 4,
  "2593": 9,
  "2594": 4,
  "2595": 16,
  "2596": 4,
  "2597": 4,
  "2598": 4,
  "2599": 9,
  "2600": 4,
  "2601": 4,
  "2602": 4,
  "2603": 9,
  "2604": 32,
  "2605": 4,
  "2606": 4,
  "2607": 18,
  "2608": 15,
  "2609": 15,
  "2610": 9,
  "2611": 4,
  "2612": 15,
  "2613": 4,
  "2614": 4,
  "2615": 14,
  "2616": 21,
  "2617": 4,
  "2618": 9,
  "2619": 9,
  "2620": 11,
  "2621": 14,
  "2622": 11,
  "2623": 23,
  "2624": 9,
  "2625": 4,
  "2626": 4,
  "2627": 9,
  "2628": 4,
  "2629": 4,
  "2630": 15,
  "2631": 14,
  "2632": 18,
  "2633": 9,
  "2634": 4,
  "2635": 21,
  "2636": 9,
  "2637": 15,
  "2638": 14,
  "2639": 4,
  "2640": 15,
  "2641": 14,
  "2642": 15,
  "2643": 14,
  "2644": 4,
  "2645": 9,
  "2646": 4,
  "2647": 16,
  "2648": 9,
  "2649": 9,
  "2650": 15,
  "2651": 21,
  "2652": 15,
  "2653": 21,
  "2654": 15,
  "2655": 9,
  "2656": 4,
  "2657": 21,
  "2658": 15,
  "2659": 15,
  "2660": 14,
  "2661": 9,
  "2662": 4,
  "2663": 16,
  "2664": 9,
  "2665": 15,
  "2666": 15,
  "2667": 4,
  "2668": 4,
  "2669": 16,
  "2670": 15,
  "2671": 36,
  "2672": 9,
  "2673": 4,
  "2674": 4,
  "2675": 4,
  "2676": 9,
  "2677": 4,
  "2678": 4,
  "2679": 21,
  "2680": 15,
  "2681": 21,
  "2682": 4,
  "2683": 4,
  "2684": 14,
  "2685": 4,
  "2686": 4,
  "2687": 4,
  "2688": 4,
  "2689": 15,
  "2690": 14,
  "2691": 8,
  "2692": 15,
  "2693": 23,
  "2694": 15,
  "2695": 4,
  "2696": 16,
  "2697": 18,
  "2698": 14,
  "2699": 15,
  "2700": 21,
  "2701": 4,
  "2702": 4,
  "2703": 4,
  "2704": 4,
  "2705": 15,
  "2706": 4,
  "2707": 21,
  "2708": 4,
  "2709": 11,
  "2710": 9,
  "2711": 4,
  "2712": 15,
  "2713": 14,
  "2714": 9,
  "2715": 15,
  "2716": 15,
  "2717": 11,
  "2718": 14,
  "2719": 9,
  "2720": 9,
  "2721": 4,
  "2722": 4,
  "2723": 4,
  "2724": 9,
  "2725": 9,
  "2726": 4,
  "2727": 4,
  "2728": 4,
  "2729": 23,
  "2730": 4,
  "2731": 4,
  "2732": 4,
  "2733": 15,
  "2734": 14,
  "2735": 4,
  "2736": 4,
  "2737": 4,
  "2738": 4,
  "2739": 16,
  "2740": 9,
  "2741": 4,
  "2742": 4,
  "2743": 4,
  "2744": 4,
  "2745": 4,
  "2746": 21,
  "2747": 15,
  "2748": 15,
  "2749": 4,
  "2750": 4,
  "2751": 9,
  "2752": 15,
  "2753": 4,
  "2754": 4,
  "2755": 16,
  "2756": 21,
  "2757": 15,
  "2758": 14,
  "2759": 9,
  "2760": 4,
  "2761": 21,
  "2762": 9,
  "2763": 4,
  "2764": 4,
  "2765": 4,
  "2766": 37,
  "2767": 11,
  "2768": 9,
  "2769": 4,
  "2770": 4,
  "2771": 21,
  "2772": 23,
  "2773": 4,
  "2774": 4,
  "2775": 9,
  "2776": 4,
  "2777": 4,
  "2778": 9,
  "2779": 4,
  "2780": 4,
  "2781": 15,
  "2782": 16,
  "2783": 4,
  "2784": 4,
  "2785": 4,
  "2786": 4,
  "2787": 4,
  "2788": 9,
  "2789": 4,
  "2790": 9,
  "2791": 15,
  "2792": 14,
  "2793": 4,
  "2794": 4,
  "2795": 4,
  "2796": 4,
  "2797": 4,
  "2798": 4,
  "2799": 4,
  "2800": 4,
  "2801": 4,
  "2802": 9,
  "2803": 14,
  "2804": 25,
  "2805": 9,
  "2806": 4,
  "2807": 9,
  "2808": 15,
  "2809": 15,
  "2810": 16,
  "2811": 9,
  "2812": 4,
  "2813": 15,
  "2814": 14,
  "2815": 15,
  "2816": 21,
  "2817": 4,
  "2818": 4,
  "2819": 16,
  "2820": 25,
  "2821": 4,
  "2822": 4,
  "2823": 14,
  "2824": 4,
  "2825": 4,
  "2826": 21,
  "2827": 9,
  "2828": 4,
  "2829": 4,
  "2830": 4,
  "2831": 9,
  "2832": 4,
  "2833": 16,
  "2834": 9,
  "2835": 15,
  "2836": 14,
  "2837": 9,
  "2838": 4,
  "2839": 9,
  "2840": 4,
  "2841": 4,
  "2842": 16,
  "2843": 4,
  "2844": 4,
  "2845": 9,
  "2846": 15,
  "2847": 4,
  "2848": 21,
  "2849": 9,
  "2850": 4,
  "2851": 4,
  "2852": 4,
  "2853": 4,
  "2854": 18,
  "2855": 4,
  "2856": 25,
  "2857": 21,
  "2858": 23,
  "2859": 11,
  "2860": 4,
  "2861": 18,
  "2862": 15,
  "2863": 11,
  "2864": 15,
  "2865": 14,
  "2866": 9,
  "2867": 4,
  "2868": 4,
  "2869": 9,
  "2870": 4,
  "2871": 4,
  "2872": 4,
  "2873": 15,
  "2874": 14,
  "2875": 9,
  "2876": 40,
  "2877": 15,
  "2878": 18,
  "2879": 23,
  "2880": 9,
  "2881": 9,
  "2882": 4,
  "2883": 4,
  "2884": 11,
  "2885": 4,
  "2886": 16,
  "2887": 4,
  "2888": 9,
  "2889": 4,
  "2890": 4,
  "2891": 9,
  "2892": 15,
  "2893": 9,
  "2894": 4,
  "2895": 15,
  "2896": 18,
  "2897": 4,
  "2898": 16,
  "2899": 15,
  "2900": 9,
  "2901": 4,
  "2902": 18,
  "2903": 8,
  "2904": 15,
  "2905": 15,
  "2906": 14,
  "2907": 9,
  "2908": 11,
  "2909": 15,
  "2910": 14,
  "2911": 9,
  "2912": 4,
  "2913": 9,
  "2914": 15,
  "2915": 9,
  "2916": 4,
  "2917": 4,
  "2918": 14,
  "2919": 4,
  "2920": 4,
  "2921": 4,
  "2922": 9,
  "2923": 4,
  "2924": 4,
  "2925": 16,
  "2926": 9,
  "2927": 15,
  "2928": 9,
  "2929": 9,
  "2930": 15,
  "2931": 14,
  "2932": 10,
  "2933": 21,
  "2934": 9,
  "2935": 4,
  "2936": 4,
  "2937": 14,
  "2938": 9,
  "2939": 4,
  "2940": 4,
  "2941": 21,
  "2942": 4,
  "2943": 4,
  "2944": 9,
  "2945": 4,
  "2946": 4,
  "2947": 15,
  "2948": 4,
  "2949": 15,
  "2950": 4,
  "2951": 15,
  "2952": 25,
  "2953": 21,
  "2954": 4,
  "2955": 4,
  "2956": 4,
  "2957": 15,
  "2958": 14,
  "2959": 9,
  "2960": 21,
  "2961": 15,
  "2962": 9,
  "2963": 4,
  "2964": 4,
  "2965": 4,
  "2966": 4,
  "2967": 16,
  "2968": 4,
  "2969": 4,
  "2970": 4,
  "2971": 4,
  "2972": 11,
  "2973": 9,
  "2974": 34,
  "2975": 23,
  "2976": 4,
  "2977": 4,
  "2978": 4,
  "2979": 15,
  "2980": 8,
  "2981": 21,
  "2982": 4,
  "2983": 4,
  "2984": 16,
  "2985": 9,
  "2986": 4,
  "2987": 23,
  "2988": 4,
  "2989": 4,
  "2990": 9,
  "2991": 18,
  "2992": 11,
  "2993": 25,
  "2994": 4,
  "2995": 23,
  "2996": 4,
  "2997": 4,
  "2998": 18,
  "2999": 11,
  "3000": 9,
  "3001": 9,
  "3002": 9,
  "3003": 15,
  "3004": 15,
  "3005": 16,
  "3006": 4,
  "3007": 15,
  "3008": 14,
  "3009": 15,
  "3010": 23,
  "3011": 11,
  "3012": 23,
  "3013": 9,
  "3014": 4,
  "3015": 18,
  "3016": 9,
  "3017": 4,
  "3018": 9,
  "3019": 4,
  "3020": 4,
  "3021": 4,
  "3022": 4,
  "3023": 4,
  "3024": 15,
  "3025": 9,
  "3026": 15,
  "3027": 11,
  "3028": 25,
  "3029": 15,
  "3030": 15,
  "3031": 14,
  "3032": 4,
  "3033": 15,
  "3034": 16,
  "3035": 4,
  "3036": 4,
  "3037": 9,
  "3038": 4,
  "3039": 4,
  "3040": 18,
  "3041": 14,
  "3042": 15,
  "3043": 14,
  "3044": 15,
  "3045": 9,
  "3046": 9,
  "3047": 4,
  "3048": 9,
  "3049": 15,
  "3050": 14,
  "3051": 4,
  "3052": 4,
  "3053": 4,
  "3054": 37,
  "3055": 37,
  "3056": 4,
  "3057": 16,
  "3058": 9,
  "3059": 4,
  "3060": 4,
  "3061": 4,
  "3062": 23,
  "3063": 4,
  "3064": 4,
  "3065": 15,
  "3066": 14,
  "3067": 4,
  "3068": 4,
  "3069": 4,
  "3070": 4,
  "3071": 4,
  "3072": 21,
  "3073": 9,
  "3074": 9,
  "3075": 21,
  "3076": 4,
  "3077": 15,
  "3078": 18,
  "3079": 9,
  "3080": 15,
  "3081": 9,
  "3082": 4,
  "3083": 21,
  "3084": 4,
  "3085": 4,
  "3086": 9,
  "3087": 9,
  "3088": 4,
  "3089": 4,
  "3090": 15,
  "3091": 4,
  "3092": 15,
  "3093": 14,
  "3094": 9,
  "3095": 4,
  "3096": 16,
  "3097": 9,
  "3098": 4,
  "3099": 4,
  "3100": 16,
  "3101": 4,
  "3102": 4,
  "3103": 9,
  "3104": 16,
  "3105": 4,
  "3106": 4,
  "3107": 4,
  "3108": 9,
  "3109": 4,
  "3110": 15,
  "3111": 14,
  "3112": 15,
  "3113": 10,
  "3114": 4,
  "3115": 9,
  "3116": 4,
  "3117": 15,
  "3118": 11,
  "3119": 14,
  "3120": 4,
  "3121": 4,
  "3122": 18,
  "3123": 15,
  "3124": 21,
  "3125": 4,
  "3126": 16,
  "3127": 11,
  "3128": 23,
  "3129": 8,
  "3130": 9,
  "3131": 15,
  "3132": 9,
  "3133": 15,
  "3134": 9,
  "3135": 9,
  "3136": 4,
  "3137": 4,
  "3138": 4,
  "3139": 23,
  "3140": 14,
  "3141": 9,
  "3142": 4,
  "3143": 15,
  "3144": 8,
  "3145": 4,
  "3146": 4,
  "3147": 11,
  "3148": 16,
  "3149": 4,
  "3150": 4,
  "3151": 4,
  "3152": 4,
  "3153": 4,
  "3154": 18,
  "3155": 9,
  "3156": 15,
  "3157": 21,
  "3158": 15,
  "3159": 9,
  "3160": 15,
  "3161": 15,
  "3162": 14,
  "3163": 4,
  "3164": 4,
  "3165": 4,
  "3166": 4,
  "3167": 14,
  "3168": 9,
  "3169": 9,
  "3170": 4,
  "3171": 16,
  "3172": 4,
  "3173": 25,
  "3174": 4,
  "3175": 9,
  "3176": 4,
  "3177": 4,
  "3178": 4,
  "3179": 9,
  "3180": 4,
  "3181": 4,
  "3182": 18,
  "3183": 9,
  "3184": 4,
  "3185": 4,
  "3186": 16,
  "3187": 11,
  "3188": 9,
  "3189": 21,
  "3190": 4,
  "3191": 4,
  "3192": 4,
  "3193": 21,
  "3194": 9,
  "3195": 9,
  "3196": 4,
  "3197": 9,
  "3198": 4,
  "3199": 4,
  "3200": 16,
  "3201": 9,
  "3202": 15,
  "3203": 11,
  "3204": 16,
  "3205": 9,
  "3206": 4,
  "3207": 21,
  "3208": 9,
  "3209": 4,
  "3210": 9,
  "3211": 9,
  "3212": 14,
  "3213": 9,
  "3214": 21,
  "3215": 4,
  "3216": 23,
  "3217": 9,
  "3218": 4,
  "3219": 4,
  "3220": 4,
  "3221": 9,
  "3222": 25,
  "3223": 4,
  "3224": 23,
  "3225": 11,
  "3226": 9,
  "3227": 4,
  "3228": 24,
  "3229": 9,
  "3230": 15,
  "3231": 14,
  "3232": 9,
  "3233": 4,
  "3234": 4,
  "3235": 18,
  "3236": 4,
  "3237": 9,
  "3238": 4,
  "3239": 15,
  "3240": 15,
  "3241": 14,
  "3242": 15,
  "3243": 15,
  "3244": 15,
  "3245": 11,
  "3246": 4,
  "3247": 4,
  "3248": 4,
  "3249": 4,
  "3250": 4,
  "3251": 23,
  "3252": 4,
  "3253": 4,
  "3254": 9,
  "3255": 16,
  "3256": 21,
  "3257": 25,
  "3258": 16,
  "3259": 9,
  "3260": 4,
  "3261": 23,
  "3262": 4,
  "3263": 4,
  "3264": 4,
  "3265": 16,
  "3266": 9,
  "3267": 9,
  "3268": 4,
  "3269": 15,
  "3270": 14,
  "3271": 15,
  "3272": 4,
  "3273": 4,
  "3274": 9,
  "3275": 4,
  "3276": 15,
  "3277": 25,
  "3278": 9,
  "3279": 11,
  "3280": 15,
  "3281": 14,
  "3282": 15,
  "3283": 21,
  "3284": 4,
  "3285": 4,
  "3286": 15,
  "3287": 4,
  "3288": 4,
  "3289": 21,
  "3290": 4,
  "3291": 15,
  "3292": 9,
  "3293": 9,
  "3294": 4,
  "3295": 21,
  "3296": 9,
  "3297": 9,
  "3298": 4,
  "3299": 15,
  "3300": 14,
  "3301": 9,
  "3302": 25,
  "3303": 4,
  "3304": 15,
  "3305": 14,
  "3306": 9,
  "3307": 4,
  "3308": 15,
  "3309": 14,
  "3310": 4,
  "3311": 16,
  "3312": 15,
  "3313": 15,
  "3314": 14,
  "3315": 4,
  "3316": 21,
  "3317": 9,
  "3318": 4,
  "3319": 4,
  "3320": 4,
  "3321": 15,
  "3322": 16,
  "3323": 4,
  "3324": 4,
  "3325": 14,
  "3326": 4,
  "3327": 4,
  "3328": 4,
  "3329": 9,
  "3330": 15,
  "3331": 14,
  "3332": 4,
  "3333": 9,
  "3334": 15,
  "3335": 14,
  "3336": 9,
  "3337": 4,
  "3338": 4,
  "3339": 37,
  "3340": 4,
  "3341": 9,
  "3342": 4,
  "3343": 4,
  "3344": 18,
  "3345": 9,
  "3346": 4,
  "3347": 4,
  "3348": 4,
  "3349": 4,
  "3350": 4,
  "3351": 4,
  "3352": 4,
  "3353": 14,
  "3354": 9,
  "3355": 4,
  "3356": 4,
  "3357": 15,
  "3358": 16,
  "3359": 9,
  "3360": 15,
  "3361": 14,
  "3362": 8,
  "3363": 4,
  "3364": 4,
  "3365": 4,
  "3366": 4,
  "3367": 4,
  "3368": 4,
  "3369": 4,
  "3370": 9,
  "3371": 4,
  "3372": 4,
  "3373": 4,
  "3374": 4,
  "3375": 8,
  "3376": 9,
  "3377": 9,
  "3378": 15,
  "3379": 4,
  "3380": 14,
  "3381": 9,
  "3382": 4,
  "3383": 16,
  "3384": 9,
  "3385": 15,
  "3386": 9,
  "3387": 34,
  "3388": 16,
  "3389": 9,
  "3390": 14,
  "3391": 9,
  "3392": 9,
  "3393": 4,
  "3394": 4,
  "3395": 4,
  "3396": 4,
  "3397": 15,
  "3398": 11,
  "3399": 4,
  "3400": 4,
  "3401": 9,
  "3402": 15,
  "3403": 14,
  "3404": 23,
  "3405": 9,
  "3406": 4,
  "3407": 4,
  "3408": 4,
  "3409": 16,
  "3410": 9,
  "3411": 4,
  "3412": 15,
  "3413": 4,
  "3414": 4,
  "3415": 4,
  "3416": 16,
  "3417": 4,
  "3418": 4,
  "3419": 15,
  "3420": 14,
  "3421": 9,
  "3422": 4,
  "3423": 15,
  "3424": 15,
  "3425": 15,
  "3426": 11,
  "3427": 9,
  "3428": 4,
  "3429": 15,
  "3430": 14,
  "3431": 4,
  "3432": 4,
  "3433": 9,
  "3434": 4,
  "3435": 4,
  "3436": 9,
  "3437": 15,
  "3438": 14,
  "3439": 9,
  "3440": 4,
  "3441": 4,
  "3442": 23,
  "3443": 15,
  "3444": 16,
  "3445": 15,
  "3446": 15,
  "3447": 14,
  "3448": 4,
  "3449": 4,
  "3450": 4,
  "3451": 18,
  "3452": 15,
  "3453": 14,
  "3454": 21,
  "3455": 21,
  "3456": 15,
  "3457": 9,
  "3458": 9,
  "3459": 25,
  "3460": 9,
  "3461": 4,
  "3462": 4,
  "3463": 16,
  "3464": 9,
  "3465": 32,
  "3466": 21,
  "3467": 4,
  "3468": 4,
  "3469": 9,
  "3470": 4,
  "3471": 4,
  "3472": 4,
  "3473": 15,
  "3474": 14,
  "3475": 9,
  "3476": 9,
  "3477": 4,
  "3478": 11,
  "3479": 9,
  "3480": 15,
  "3481": 16,
  "3482": 9,
  "3483": 4,
  "3484": 15,
  "3485": 25,
  "3486": 4,
  "3487": 4,
  "3488": 14,
  "3489": 4,
  "3490": 15,
  "3491": 16,
  "3492": 32,
  "3493": 4,
  "3494": 21,
  "3495": 21,
  "3496": 4,
  "3497": 9,
  "3498": 21,
  "3499": 9,
  "3500": 9,
  "3501": 15,
  "3502": 14,
  "3503": 9,
  "3504": 4,
  "3505": 4,
  "3506": 9,
  "3507": 21,
  "3508": 4,
  "3509": 15,
  "3510": 15,
  "3511": 9,
  "3512": 4,
  "3513": 21,
  "3514": 15,
  "3515": 14,
  "3516": 11,
  "3517": 11,
  "3518": 23,
  "3519": 4,
  "3520": 15,
  "3521": 4,
  "3522": 16,
  "3523": 23,
  "3524": 9,
  "3525": 14,
  "3526": 4,
  "3527": 4,
  "3528": 4,
  "3529": 7,
  "3530": 4,
  "3531": 4,
  "3532": 16,
  "3533": 4,
  "3534": 16,
  "3535": 21,
  "3536": 4,
  "3537": 4,
  "3538": 4,
  "3539": 16,
  "3540": 9,
  "3541": 4,
  "3542": 4,
  "3543": 4,
  "3544": 4,
  "3545": 11,
  "3546": 9,
  "3547": 4,
  "3548": 15,
  "3549": 14,
  "3550": 4,
  "3551": 4,
  "3552": 4,
  "3553": 4,
  "3554": 4,
  "3555": 14,
  "3556": 9,
  "3557": 15,
  "3558": 14,
  "3559": 9,
  "3560": 4,
  "3561": 4,
  "3562": 4,
  "3563": 9,
  "3564": 4,
  "3565": 4,
  "3566": 4,
  "3567": 4,
  "3568": 4,
  "3569": 15,
  "3570": 14,
  "3571": 15,
  "3572": 16,
  "3573": 9,
  "3574": 4,
  "3575": 21,
  "3576": 9,
  "3577": 4,
  "3578": 9,
  "3579": 4,
  "3580": 16,
  "3581": 9,
  "3582": 15,
  "3583": 14,
  "3584": 4,
  "3585": 4,
  "3586": 37,
  "3587": 4,
  "3588": 9,
  "3589": 15,
  "3590": 9,
  "3591": 4,
  "3592": 15,
  "3593": 15,
  "3594": 15,
  "3595": 11,
  "3596": 16,
  "3597": 4,
  "3598": 4,
  "3599": 4,
  "3600": 16,
  "3601": 15,
  "3602": 14,
  "3603": 4,
  "3604": 15,
  "3605": 18,
  "3606": 9,
  "3607": 4,
  "3608": 15,
  "3609": 16,
  "3610": 15,
  "3611": 36,
  "3612": 9,
  "3613": 15,
  "3614": 15,
  "3615": 14,
  "3616": 11,
  "3617": 9,
  "3618": 4,
  "3619": 4,
  "3620": 18,
  "3621": 8,
  "3622": 4,
  "3623": 15,
  "3624": 16,
  "3625": 4,
  "3626": 4,
  "3627": 9,
  "3628": 4,
  "3629": 4,
  "3630": 8,
  "3631": 9,
  "3632": 15,
  "3633": 4,
  "3634": 18,
  "3635": 9,
  "3636": 15,
  "3637": 4,
  "3638": 15,
  "3639": 21,
  "3640": 9,
  "3641": 4,
  "3642": 4,
  "3643": 4,
  "3644": 4,
  "3645": 15,
  "3646": 36,
  "3647": 11,
  "3648": 9,
  "3649": 4,
  "3650": 4,
  "3651": 4,
  "3652": 16,
  "3653": 9,
  "3654": 4,
  "3655": 15,
  "3656": 14,
  "3657": 9,
  "3658": 4,
  "3659": 4,
  "3660": 8,
  "3661": 21,
  "3662": 4,
  "3663": 9,
  "3664": 4,
  "3665": 15,
  "3666": 15,
  "3667": 8,
  "3668": 15,
  "3669": 14,
  "3670": 15,
  "3671": 4,
  "3672": 16,
  "3673": 21,
  "3674": 4,
  "3675": 9,
  "3676": 9,
  "3677": 15,
  "3678": 14,
  "3679": 9,
  "3680": 4,
  "3681": 4,
  "3682": 4,
  "3683": 11,
  "3684": 16,
  "3685": 11,
  "3686": 23,
  "3687": 9,
  "3688": 4,
  "3689": 16,
  "3690": 11,
  "3691": 23,
  "3692": 9,
  "3693": 4,
  "3694": 15,
  "3695": 14,
  "3696": 9,
  "3697": 4,
  "3698": 4,
  "3699": 4,
  "3700": 4,
  "3701": 4,
  "3702": 4,
  "3703": 25,
  "3704": 4,
  "3705": 23,
  "3706": 15,
  "3707": 21,
  "3708": 4,
  "3709": 4,
  "3710": 15,
  "3711": 14,
  "3712": 9,
  "3713": 15,
  "3714": 14,
  "3715": 4,
  "3716": 16,
  "3717": 21,
  "3718": 10,
  "3719": 15,
  "3720": 9,
  "3721": 9,
  "3722": 4,
  "3723": 4,
  "3724": 18,
  "3725": 11,
  "3726": 9,
  "3727": 4,
  "3728": 4,
  "3729": 9,
  "3730": 11,
  "3731": 11,
  "3732": 15,
  "3733": 14,
  "3734": 15,
  "3735": 14,
  "3736": 9,
  "3737": 15,
  "3738": 15,
  "3739": 14,
  "3740": 4,
  "3741": 4,
  "3742": 37,
  "3743": 9,
  "3744": 15,
  "3745": 18,
  "3746": 11,
  "3747": 9,
  "3748": 4,
  "3749": 4,
  "3750": 23,
  "3751": 4,
  "3752": 15,
  "3753": 23,
  "3754": 4,
  "3755": 15,
  "3756": 9,
  "3757": 4,
  "3758": 16,
  "3759": 9,
  "3760": 15,
  "3761": 16,
  "3762": 32,
  "3763": 15,
  "3764": 9,
  "3765": 15,
  "3766": 4,
  "3767": 18,
  "3768": 21,
  "3769": 10,
  "3770": 4,
  "3771": 4,
  "3772": 14,
  "3773": 23,
  "3774": 11,
  "3775": 36,
  "3776": 11,
  "3777": 21,
  "3778": 4,
  "3779": 4,
  "3780": 9,
  "3781": 21,
  "3782": 4,
  "3783": 43,
  "3784": 4,
  "3785": 21,
  "3786": 9,
  "3787": 9,
  "3788": 4,
  "3789": 10,
  "3790": 15,
  "3791": 11,
  "3792": 14,
  "3793": 9,
  "3794": 4,
  "3795": 15,
  "3796": 14,
  "3797": 9,
  "3798": 4,
  "3799": 15,
  "3800": 4,
  "3801": 15,
  "3802": 18,
  "3803": 9,
  "3804": 23,
  "3805": 4,
  "3806": 4,
  "3807": 15,
  "3808": 11,
  "3809": 14,
  "3810": 9,
  "3811": 9,
  "3812": 23,
  "3813": 9,
  "3814": 4,
